rottenpotatoes/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "rating" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "G"], ["release_date", "2016-03-14 00:00:00.000000"], ["updated_at", "2016-03-14 21:49:33.917266"], ["id", 3]]

  def find_by_director
    @id = params[:id]
    @movie = Movie.find(params[:id])
    @director = @movie.director
    @movies = @movie.find_movies_with_same_director
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 16]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]